todo-api/app/controllers/todos_controller.rb

  def index
    todos = Todo.order("created_at DESC")
---
SELECT "todos".* FROM "todos" ORDER BY created_at DESC

  def create
    todo = Todo.create(todo_param)
---
INSERT INTO "todos" ("task", "done", "date", "priority", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["task", "William"], ["done", 0], ["date", "00/00/0000"], ["priority", ""], ["created_at", "2020-05-28 20:44:59.732829"], ["updated_at", "2020-05-28 20:44:59.732829"]]

  def update
    todo = Todo.find(params[:id])
    todo.update_attributes(todo_param)
---
SELECT "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
UPDATE "todos" SET "task" = ?, "date" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["task", "William"], ["date", "00/00/0000"], ["updated_at", "2020-05-28 21:20:02.440720"], ["id", 1]]

  def destroy
    todo = Todo.find(params[:id])
    todo.destroy
---
SELECT "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "todos" WHERE "todos"."id" = ?  [["id", 1]]