todo-api/app/controllers/users_controller.rb

SELECT "users".* FROM "users" ORDER BY created_at DESC
---
  def index
    users = User.order("created_at DESC")

INSERT INTO "users" ("username", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "test"], ["password", ""], ["created_at", "2020-05-29 02:47:57.775418"], ["updated_at", "2020-05-29 02:47:57.775418"]]
---
  def create
    user = User.create(user_param)